R1#enable
R1#dir
Directory of flash:/

No files in directory

66875392 bytes total (66875392 bytes free)
R1#format flash:
Format operation may take a while. Continue? [confirm]
Format operation will destroy all data in "flash:".  Continue? [confirm]
Format: Drive communication & 1st Sector Write OK...
Writing Monlib sectors.
.........................................................................................................................
Monlib write complete
..
Format: All system sectors written. OK...

Format: Total sectors in formatted partition: 130911
Format: Total bytes in formatted partition: 67026432
Format: Operation completed successfully.

Format of flash complete
R1#show inventory | include DESCR
NAME: "3745 chassis", DESCR: "3745 chassis"
NAME: "c3745 Motherboard with Fast Ethernet", DESCR: "c3745 Motherboard with Fast Ethernet"
R1#show version | include [Pp]rocessor [Bb]oard [IDid]
Processor board ID FTX0945W0MY
R1#show version | include [IOSios] [Ss]oftware
Cisco IOS Software, 3700 Software (C3745-ADVENTERPRISEK9-M), Version 12.4(25d), RELEASE SOFTWARE (fc1)
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
FastEthernet0/1            unassigned      YES unset  administratively down down
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface FastEthernet0/0
R1(config-if)#ip address 192.168.1.20 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#
*Mar  1 00:02:46.463: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:02:47.463: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R1(config-if)#end
R1#
*Mar  1 00:02:56.151: %SYS-5-CONFIG_I: Configured from console by console
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            192.168.1.20    YES manual up                    up
FastEthernet0/1            unassigned      YES unset  administratively down down
R1#ping 192.168.1.10 repeat 4

Type escape sequence to abort.
Sending 4, 100-byte ICMP Echos to 192.168.1.10, timeout is 2 seconds:
.!!!
Success rate is 75 percent (3/4), round-trip min/avg/max = 32/42/56 ms
R1#; Start the host TFTP service
R1#; bash: sudo firewall-cmd --zone=public --add-port=69/udp
R1#; bash: sudo firewall-cmd --zone=public --add-service=tftp
R1#; bash: sudo mkdir --parents /var/lib/tftpboot/
R1#; bash: sudo chmod 777 /var/lib/tftpboot/
R1#; bash: sudo touch /var/lib/tftpboot/startup-config.tftp
R1#; bash: sudo chmod 777 /var/lib/tftpboot/startup-config.tftp
R1#; bash: sudo systemctl start tftp
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip tftp source-interface FastEthernet0/0
R1(config)#end
R1#
*Mar  1 00:03:59.055: %SYS-5-CONFIG_I: Configured from console by console
R1#copy system:running-config nvram:startup-config
Destination filename [startup-config]? startup-config
Building configuration...
[OK]
R1#copy nvram:startup-config tftp:
Address or name of remote host []? 192.168.1.10
Destination filename [r1-confg]? startup-config.tftp
!!
937 bytes copied in 0.100 secs (9370 bytes/sec)
R1#copy tftp: flash:
Address or name of remote host []? 192.168.1.10
Source filename []? startup-config.tftp
Destination filename [startup-config.tftp]? startup-config.tftp
Accessing tftp://192.168.1.10/startup-config.tftp...
Loading startup-config.tftp from 192.168.1.10 (via FastEthernet0/0): !
[OK - 937 bytes]

937 bytes copied in 1.392 secs (673 bytes/sec)
R1#copy flash: tftp:
Source filename []? startup-config.tftp
Address or name of remote host []? 192.168.1.10
Destination filename [startup-config.tftp]? startup-config.tftp
!!
937 bytes copied in 0.132 secs (7098 bytes/sec)
R1#; Stop the host TFTP service
R1#; bash: sudo systemctl stop tftp
R1#; bash: sudo firewall-cmd --zone=public --remove-service=tftp
R1#; bash: sudo firewall-cmd --zone=public --remove-port=69/udp
R1#; Start the host FTP service
R1#; bash: sudo firewall-cmd --zone=public --add-port=20/tcp
R1#; bash: sudo firewall-cmd --zone=public --add-port=21/tcp
R1#; bash: sudo firewall-cmd --zone=public --add-service=ftp
R1#; bash: sudo sed --in-place --expression "\$aftp_username=gns3user" /etc/vsftpd/vsftpd.conf
R1#; bash: sudo systemctl start vsftpd
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip ftp username gns3user
R1(config)#ip ftp password gns3user
R1(config)#ip ftp source-interface FastEthernet0/0
R1(config)#end
R1#
*Mar  1 00:12:59.967: %SYS-5-CONFIG_I: Configured from console by console
R1#copy system:running-config nvram:startup-config
Destination filename [startup-config]? startup-config
Building configuration...
[OK]
R1#copy nvram:startup-config ftp:
Address or name of remote host []? 192.168.1.10
Destination filename [r1-confg]? startup-config.ftp
Writing startup-config.ftp
1027 bytes copied in 0.952 secs (1079 bytes/sec)
R1#copy ftp: flash:
Address or name of remote host []? 192.168.1.10
Source filename []? startup-config.ftp
Destination filename [startup-config.ftp]? startup-config.ftp
Accessing ftp://192.168.1.10/startup-config.ftp...
Loading startup-config.ftp !
[OK - 1027/4096 bytes]

1027 bytes copied in 0.876 secs (1172 bytes/sec)
R1#copy flash: ftp:
Source filename []? startup-config.ftp
Address or name of remote host []? 192.168.1.10
Destination filename [startup-config.ftp]? startup-config.ftp
Writing startup-config.ftp !
1027 bytes copied in 0.684 secs (1501 bytes/sec)
R1#; Stop the host FTP service
R1#; bash: sudo systemctl stop vsftpd
R1#; bash: sudo sed --in-place "/ftp_username=gns3user/d" /etc/vsftpd/vsftpd.conf
R1#; bash: sudo firewall-cmd --zone=public --remove-service=ftp
R1#; bash: sudo firewall-cmd --zone=public --remove-port=21/tcp
R1#; bash: sudo firewall-cmd --zone=public --remove-port=20/tcp
R1#; Start the host SCP service
R1#; bash: sudo firewall-cmd --zone=public --add-port=22/tcp
R1#; bash: sudo firewall-cmd --zone=public --add-service=ssh
R1#; bash: sudo touch /var/lib/tftpboot/startup-config.scp
R1#; bash: sudo chmod 777 /var/lib/tftpboot/startup-config.scp
R1#; bash: sudo systemctl start sshd
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip scp source-interface FastEthernet0/0
R1(config)#crypto key zeroize rsa
% No Signature RSA Keys found in configuration.

R1(config)#crypto key generate rsa general-keys label ADVENTURES modulus 1024
The name for the keys will be: ADVENTURES

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

R1(config)#
*Mar  1 00:41:55.171: %SSH-5-ENABLED: SSH 1.99 has been enabled
R1(config)#end
R1#
*Mar  1 00:42:01.863: %SYS-5-CONFIG_I: Configured from console by console
R1#copy system:running-config nvram:startup-config
Destination filename [startup-config]? startup-config
Building configuration...
[OK]
R1#copy nvram:/startup-config scp:
Address or name of remote host []? 192.168.1.10
Destination username [R1]? gns3user
Destination filename [r1-confg]? /var/lib/tftpboot/startup-config.scp
Writing /var/lib/tftpboot/startup-config.scp
Password:
! Sink: C0644 1067 startup-config.scp

1067 bytes copied in 10.884 secs (98 bytes/sec)
R1#copy scp: flash:
Address or name of remote host []? 192.168.1.10
Source username [R1]? gns3user
Source filename []? /var/lib/tftpboot/startup-config.scp
Destination filename [startup-config.scp]? startup-config.scp

Password:
 Sending file modes: C0777 1067 startup-config.scp
!
1067 bytes copied in 3.780 secs (282 bytes/sec)
R1#copy flash: scp:
Source filename []? startup-config.scp
Address or name of remote host []? 192.168.1.10
Destination username [R1]? gns3user
Destination filename [startup-config.scp]? startup-config.scp
Writing startup-config.scp
Password:
! Sink: C0644 1067 startup-config.scp

1067 bytes copied in 4.068 secs (262 bytes/sec)
R1#; No need to stop SSH service
R1#

Switch#copy start scp:
Address or name of remote host []? 192.168.1.10
Destination username [Switch]? gns3user
Destination filename [switch-confg]?
Writing switch-confg
Password:
! Sink: C0644 3600 switch-confg

3600 bytes copied in 15.393 secs (234 bytes/sec)
Switch#copy scp: flash0:
Address or name of remote host []? 192.168.1.10
Source username [Switch]? gns3user
Source filename []? switch-confg
Destination filename [switch-confg]?
Password:
 Sending file modes: C0644 3600 switch-confg
!
3600 bytes copied in 12.927 secs (278 bytes/sec)
Switch#copy start scp:
Address or name of remote host []? 192.168.1.10
Destination username [Switch]? gns3user
Destination filename [switch-confg]?
Writing switch-confg
Password:
! Sink: C0644 3600 switch-confg

3600 bytes copied in 17.523 secs (205 bytes/sec)
Switch#copy scp: flash0:
Address or name of remote host []? 192.168.1.10
Source username [Switch]? gns3user
Source filename []? switch-confg
Destination filename [switch-confg]?
%Warning:There is a file already existing with this name
Do you want to over write? [confirm]
Password:
 Sending file modes: C0644 3600 switch-confg
!
3600 bytes copied in 26.230 secs (137 bytes/sec)
Switch#copy flash0: scp:
Source filename []? switch-confg
Address or name of remote host []? 192.168.1.10
Destination username [Switch]? gns3user
Destination filename [switch-confg]? switch-confg
Writing switch-confg
Password:
! Sink: C0644 3600 switch-confg

3600 bytes copied in 13.285 secs (271 bytes/sec)
Switch#copy start tftp:
Address or name of remote host []? 192.168.1.10
Destination filename [switch-confg]? switch-confg
!!
3600 bytes copied in 0.033 secs (109091 bytes/sec)
Switch#copy tftp: flash0:
Address or name of remote host []? 192.168.1.10
Source filename []? switch-confg
Destination filename [switch-confg]? switch-confg
%Warning:There is a file already existing with this name
Do you want to over write? [confirm]
Accessing tftp://192.168.1.10/switch-confg...
Loading switch-confg from 192.168.1.10 (via Vlan1): !
[OK - 3600 bytes]

3600 bytes copied in 0.385 secs (9351 bytes/sec)
Switch#copy flash0: tftp:
Source filename []? switch-confg
Address or name of remote host []? 192.168.1.10
Destination filename [switch-confg]? switch-confg
!!
3600 bytes copied in 0.030 secs (120000 bytes/sec)
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#ip ftp username gns3user
Switch(config)#ip ftp password gns3user
Switch(config)#end
Switch#
*May  3 00:27:42.026: %SYS-5-CONFIG_I: Configured from console by console
Switch#copy start ftp:
Address or name of remote host []? 192.168.1.10
Destination filename [switch-confg]? switch-confg
Writing switch-confg !
3600 bytes copied in 11.702 secs (308 bytes/sec)
Switch#copy ftp: flash0:
Address or name of remote host []? 192.168.1.10
Source filename []? switch-confg
Destination filename [switch-confg]? switch-confg
%Warning:There is a file already existing with this name
Do you want to over write? [confirm]
Accessing ftp://192.168.1.10/switch-confg...
Loading switch-confg !
[OK - 3600/4096 bytes]

3600 bytes copied in 0.529 secs (6805 bytes/sec)
Switch#copy flash0: ftp:
Source filename []? switch-confg
Address or name of remote host []? 192.168.1.10
Destination filename [switch-confg]? switch-confg
Writing switch-confg !
3600 bytes copied in 0.117 secs (30769 bytes/sec)
Switch#