[gns3user@localhost ~]$ sudo firewall-cmd --zone=public --add-port=23/tcp
[sudo] password for gns3user:
success
[gns3user@localhost ~]$ sudo firewall-cmd --zone=public --add-service=tftp
success
[gns3user@localhost ~]$ sudo mkdir --parents --verbose /var/lib/tftpboot
[gns3user@localhost ~]$ sudo chmod 777 --verbose /var/lib/tftpboot
mode of ‘/var/lib/tftpboot’ retained as 0777 (rwxrwxrwx)
[gns3user@localhost ~]$ sudo touch /var/lib/tftpboot/startup-config.bak
[gns3user@localhost ~]$ sudo chmod 777 --verbose /var/lib/tftpboot/startup-config.bak
mode of ‘/var/lib/tftpboot/startup-config.bak’ changed from 0644 (rw-r--r--) to 0777 (rwxrwxrwx)
[gns3user@localhost ~]$ sudo systemctl enable tftp
Created symlink from /etc/systemd/system/sockets.target.wants/tftp.socket to /usr/lib/systemd/system/tftp.socket.
[gns3user@localhost ~]$ sudo systemctl start tftp
[gns3user@localhost ~]$ sudo firewall-cmd --zone=public --remove-port=23/tcp
[sudo] password for gns3user:
success
[gns3user@localhost ~]$ sudo systemctl stop tftp
Warning: Stopping tftp.service, but it can still be activated by:
  tftp.socket
[gns3user@localhost ~]$ sudo systemctl disable tftp
Removed symlink /etc/systemd/system/sockets.target.wants/tftp.socket.
[gns3user@localhost ~]$ sudo firewall-cmd --zone=public --remove-service=tftp
success
[gns3user@localhost ~]$ telnet 192.168.1.20
Trying 192.168.1.20...
Connected to 192.168.1.20.
Escape character is '^]'.


User Access Verification

Password:
R1>enable
Password:
R1#show line
   Tty Typ     Tx/Rx    A Modem  Roty AccO AccI   Uses   Noise  Overruns   Int
      0 CTY              -    -      -    -    -      0       0     0/0       -
    161 AUX   9600/9600  -    -      -    -    -      0       0     0/0       -
*   162 VTY              -    -      -    -    -      1       0     0/0       -
    163 VTY              -    -      -    -    -      0       0     0/0       -
    164 VTY              -    -      -    -    -      0       0     0/0       -
    165 VTY              -    -      -    -    -      0       0     0/0       -
    166 VTY              -    -      -    -    -      0       0     0/0       -

Line(s) not in async mode -or- with no hardware support:
1-160

R1#reload
Proceed with reload? [confirm]
Connection closed by foreign host.
[gns3user@localhost ~]$ telnet 192.168.1.20
Trying 192.168.1.20...
Connected to 192.168.1.20.
Escape character is '^]'.


User Access Verification

Password:
R1>enable
Password:
R1#
telnet> q
Connection closed.
[gns3user@localhost ~]$
