[gns3user@localhost ~]$ telnet 192.168.1.1 5001
Trying 192.168.1.1...
Will send carriage returns as telnet <CR><LF>.
Connected to 192.168.1.1.
Escape character is '^]'.
Connected to Dynamips VM "R1" (ID 1, type c7200) - Console port
Press ENTER to get the prompt.
ROMMON emulation microcode.

                           Launching IOS image at 0x80008000...

              Restricted Rights Legend

Use, duplication, or disclosure by the Government is
subject to restrictions as set forth in subparagraph
(c) of the Commercial Computer Software - Restricted
Rights clause at FAR sec. 52.227-19 and subparagraph
(c) (1) (ii) of the Rights in Technical Data and Computer
Software clause at DFARS sec. 252.227-7013.

           cisco Systems, Inc.
           170 West Tasman Drive
           San Jose, California 95134-1706



Cisco IOS Software, 7200 Software (C7200-A3JK9S-M), Version 12.4(25d), RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2010 by Cisco Systems, Inc.
Compiled Wed 18-Aug-10 11:54 by prod_rel_team


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco 7206VXR (NPE400) processor (revision A) with 491520K/32768K bytes of memory.
Processor board ID 4279256517
R7000 CPU at 150MHz, Implementation 39, Rev 2.1, 256KB L2, 512KB L3 Cache
6 slot VXR midplane, Version 2.1

Last reset from power-on

PCI bus mb0_mb1 (Slots 0, 1, 3 and 5) has a capacity of 600 bandwidth points.
Current configuration on bus mb0_mb1 has a total of 200 bandwidth points.
This configuration is within the PCI bus capacity and is supported.

PCI bus mb2 (Slots 2, 4, 6) has a capacity of 600 bandwidth points.
Current configuration on bus mb2 has a total of 0 bandwidth points
This configuration is within the PCI bus capacity and is supported.

Please refer to the following document "Cisco 7200 Series Port Adaptor
Hardware Configuration Guidelines" on Cisco.com <http://www.cisco.com>
for c7200 bandwidth points oversubscription and usage guidelines.


1 FastEthernet interface
509K bytes of NVRAM.

8192K bytes of Flash internal SIMM (Sector size 256K).
% Crashinfo may not be recovered at bootflash:crashinfo
% This file system device reports an error


Press RETURN to get started!


*Mar 30 02:58:38.591: %LINEPROTO-5-UPDOWN: Line protocol on Interface VoIP-Null0, changed state to up
*Mar 30 02:58:38.819: %SYS-5-CONFIG_I: Configured from memory by console
*Mar 30 02:58:38.947: %LINEPROTO-5-UPDOWN: Line protocol on Interface IPv6-mpls, changed state to up
*Mar 30 02:58:39.203: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 7200 Software (C7200-A3JK9S-M), Version 12.4(25d), RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2010 by Cisco Systems, Inc.
Compiled Wed 18-Aug-10 11:54 by prod_rel_team
*Mar 30 02:58:39.239: %SNMP-5-COLDSTART: SNMP agent on host R1 is undergoing a cold start
*Mar 30 02:58:39.295: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Mar 30 02:58:39.295: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar 30 02:58:40.295: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R1#
R1#enable
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface FastEthernet0/0
R1(config-if)#ip address 192.168.1.10 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#exit
R1(config)#ip route 0.0.0.0 0.0.0.0 192.168.1.1
R1(config)#crypto key zeroize rsa
% All RSA keys will be removed.
% All router certs issued using these keys will also be removed.
Do you really want to remove these keys? [yes/no]: yes
R1(config)#
*Mar 30 02:59:21.323: %SSH-5-DISABLED: SSH 1.99 has been disabled
R1(config)#crypto key generate rsa general-keys label gns3user modulus 1024
The name for the keys will be: gns3user

% The key modulus size is 1024 bits
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

*Mar 30 02:59:27.263: %SSH-5-ENABLED: SSH 1.99 has been enabled
R1(config)#
R1(config)#ip scp server enable
R1(config)#ip tftp source-interface FastEthernet0/0
R1(config)#end
R1#write memory
Building configuration...
[OK]
R1#
*Mar 30 02:59:30.271: %SYS-5-CONFIG_I: Configured from console by console
R1#
R1#copy nvram:startup-config tftp:
Address or name of remote host []? 192.168.1.1
Destination filename [r1-confg]? r1-config-2021-03-30-0259.cfg
!!
857 bytes copied in 0.100 secs (8570 bytes/sec)
R1#
R1#copy tftp: nvram:startup-config:
Address or name of remote host []? 192.168.1.1
Source filename []? R1_7206_i1_startup-config.cfg
Destination filename [startup-config:]? startup-config
Accessing tftp://192.168.1.1/R1_7206_i1_startup-config.cfg...
Loading R1_7206_i1_startup-config.cfg from 192.168.1.1 (via FastEthernet0/0): !
[OK - 857 bytes]
[OK]
857 bytes copied in 0.572 secs (1498 bytes/sec)
R1#reload
Proceed with reload? [confirm]

*Mar 30 02:59:51.327: %SYS-5-CONFIG_NV_I: Nonvolatile storage configured from tftp://192.168.1.1/R1_7206_i1_startup-config.cfg by console
*Mar 30 02:59:52.471: %SYS-5-RELOAD: Reload requested by console. Reload Reason: Reload Command.

                                                                                                ROM: reload requested...
                                                                                                                        Connection closed by foreign host.
[gns3user@localhost ~]$